Catalogs/ПЛ_УведомленияОСобытиях.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Catalog>
		<Properties>
			<Name>ПЛ_УведомленияОСобытиях</Name>
			<Comment>Содержит настройки рассылок и уведомлений заинтересованных лиц о событиях, происходящие в системе</Comment>
			<Hierarchical>false</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Событие</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ПЛ_События</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СписокПолучателей</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ТекстСообщения</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОбычныйТекст</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СхемаШаблонаТекстовСообщения</Name>
					<Type>
						<v8:Type>v8:ValueStorage</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НастройкиШаблонаТекстовСообщения</Name>
					<Type>
						<v8:Type>v8:ValueStorage</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДелениеПоАдресатам</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ПЛ_ДелениеУведомленийПоАдресатам</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ФильтрПоАдресатам</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КонтрольПовторнойОтправки</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СпособДоставки</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ПЛ_СпособыДоставкиУведомлений</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЭлПочта</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СервисПочтовойРассылки</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СМС</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Напоминание</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОбратныйАдрес</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>128</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ИмяОтправителя</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЕстьВложения</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ФорматВложений</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>10</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Статус</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>2</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаОтправки</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>РегламентноеЗадание</Name>
					<Type>
						<v8:Type>v8:UUID</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ИдентификаторСообщения</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>14</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>Получатели</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>СпособАдресацииУведомления</Name>
							<Type>
								<v8:Type>cfg:EnumRef.ПЛ_СпособыАдресацииУведомлений</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Адресат</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:TypeSet>cfg:CatalogRef</v8:TypeSet>
								<v8:StringQualifiers>
									<v8:Length>255</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СхемаВыборкиАдресатов</Name>
							<Type>
								<v8:Type>v8:ValueStorage</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>НастройкиВыборкиАдресатов</Name>
							<Type>
								<v8:Type>v8:ValueStorage</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>АдресСхемыВыборкиАдресатов</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>0</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>АдресНастроекВыборкиАдресатов</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>0</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ВидУсловийОтправкиУведомления</Name>
							<Type>
								<v8:Type>cfg:EnumRef.ПЛ_ВидыУсловийУведомлений</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СтрокаУсловий</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>0</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СхемаУсловийОтправкиУведомления</Name>
							<Type>
								<v8:Type>v8:ValueStorage</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>НастройкиУсловийОтправкиУведомления</Name>
							<Type>
								<v8:Type>v8:ValueStorage</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>АдресСхемыУсловий</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>0</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>АдресНастроекУсловий</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>0</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Включен</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Комментарий</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>0</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>ТаблицыШаблонов</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Имя</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>128</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Настройки</Name>
							<Type>
								<v8:Type>v8:ValueStorage</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>АдресНастроек</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>0</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Вложение</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>Вложения</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Вложение</Name>
							<Type>
								<v8:Type>v8:ValueStorage</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Идентификатор</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>0</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Имя</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>255</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Картинка</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>ПечатныеФормы</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>ПечатнаяФорма</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>150</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Внешняя</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>ПрисоединенныеФайлы</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Имя</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>255</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Вложение</Name>
							<Type>
								<v8:Type>v8:ValueStorage</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

Catalogs/ПЛ_УведомленияОСобытиях/Forms/УведомленияОСобытияхУстар/Ext/Form/Module.bsl
////////////////////////////////////////////////////////////////////////////////
// ОБРАБОТЧИКИ СОБЫТИЙ ФОРМЫ

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Платформа83 = ПЛ_УведомленияОСобытиях.Платформа83();
	
	ОтборУведомленийПоСобытию = Истина;
	
	РезультатОбновления = ПЛ_УведомленияОСобытиях.ВыполнитьОбновление();
	
	ЭтоПервыйЗапуск     = РезультатОбновления.ЭтоПервыйЗапуск;
	ЕстьИзменениеВерсии = РезультатОбновления.ЕстьИзменениеВерсии;
	ВесПредыдущейВерсии = РезультатОбновления.Версия.Вес;
	ТекущаяВерсия       = РезультатОбновления.ТекущаяВерсия;
	
	ПочтаНастроена = Ложь;
	РассылкиНастроены = Ложь;
	СМСДоступны = Ложь;
	СМСНастроены = Ложь;
	НапоминанияДоступны = Ложь;
	ПЛ_УведомленияОСобытиях.ПроверитьНастройкиСпособовДоставки(ПочтаНастроена, СМСДоступны, СМСНастроены, НапоминанияДоступны, РассылкиНастроены);
	
	Элементы.СМС.Видимость = Платформа83;
	Элементы.Напоминание.Видимость = НапоминанияДоступны;
	
	События.Параметры.УстановитьЗначениеПараметра("СтрокаПоРасписанию", НСтр("ru = 'По расписанию'"));
	События.Параметры.УстановитьЗначениеПараметра("СтрокаРассылка", НСтр("ru = 'Рассылка'"));
	
	Константы.ПЛ_НастройкиУведомлений.СоздатьМенеджерЗначения().СохранитьНастройку("НоваяФормаУведомлений", Ложь);
	
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	
	Если ЭтоПервыйЗапуск ИЛИ ЕстьИзменениеВерсии Тогда
		
		СтруктураПараметров = Новый Структура;
		СтруктураПараметров.Вставить("ВыводитьВсеВерсии",    Ложь);
		СтруктураПараметров.Вставить("ЭтоПервыйЗапуск",      ЭтоПервыйЗапуск);
		СтруктураПараметров.Вставить("ЕстьИзменениеВерсии",  ЕстьИзменениеВерсии);
		СтруктураПараметров.Вставить("ВесПредыдущейВерсии",  ВесПредыдущейВерсии);
		СтруктураПараметров.Вставить("ТекущаяВерсия",        ТекущаяВерсия);
		
		#Если ТолстыйКлиентОбычноеПриложение Тогда
			ОткрытьФормуМодально("Справочник.ПЛ_УведомленияОСобытиях.Форма.ОписаниеИзмененийКонфигурации",
				СтруктураПараметров);
		#Иначе
			ОткрытьФорму("Справочник.ПЛ_УведомленияОСобытиях.Форма.ОписаниеИзмененийКонфигурации",
				СтруктураПараметров);
		#КонецЕсли
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ОбработкаОповещения(ИмяСобытия, Параметр, Источник)
	
	Если ИмяСобытия = "Запись_Уведомления" Тогда
		Элементы.События.Обновить();
	КонецЕсли;
	
КонецПроцедуры

////////////////////////////////////////////////////////////////////////////////
// ОБРАБОТЧИКИ СОБЫТИЙ ЭЛЕМЕНТОВ ФОРМЫ

&НаКлиенте
Процедура СобытияПриАктивизацииСтроки(Элемент)
	
	Если ОтборУведомленийПоСобытию Тогда
		ПодключитьОбработчикОжидания("УстановитьОтборУведомленийПоТекущемуСобытию", 0.2, Истина);
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура УведомленияПередНачаломДобавления(Элемент, Отказ, Копирование, Родитель, Группа)
	
	ТекущиеДанные = Элементы.События.ТекущиеДанные;
	
	Если НЕ Группа
		И НЕ Копирование
		И ОтборУведомленийПоСобытию
		И ТекущиеДанные <> Неопределено
		И ТипЗнч(ТекущиеДанные) <> Тип("СтрокаГруппировкиДинамическогоСписка") Тогда
		
		Отказ = Истина;
		
		ЗначенияЗаполнения = Новый Структура("Событие", ТекущиеДанные.Ссылка);
		ПараметрыФормы = Новый Структура("ЗначенияЗаполнения", ЗначенияЗаполнения);
		
		ОткрытьФорму("Справочник.ПЛ_УведомленияОСобытиях.ФормаОбъекта", ПараметрыФормы);
	КонецЕсли;
	
КонецПроцедуры

////////////////////////////////////////////////////////////////////////////////
// ОБРАБОТЧИКИ КОМАНД ФОРМЫ

&НаКлиенте
Процедура КомандаОтборУведомленийПоСобытию(Команда)
	
	ОтборУведомленийПоСобытию = НЕ ОтборУведомленийПоСобытию;
	Элементы.УведомленияОтборУведомленийПоСобытию.Пометка = ОтборУведомленийПоСобытию;
	
	Если ОтборУведомленийПоСобытию Тогда
		УстановитьОтборУведомленийПоТекущемуСобытию();
	Иначе
		УстановитьОтборУведомленийПоСобытию(Неопределено, Ложь);
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура Настройки(Команда)
	
	ОткрытьФорму("Справочник.ПЛ_УведомленияОСобытиях.Форма.НастройкиПараметровУведомлений",
		,
		ЭтаФорма,
		,
		ВариантОткрытияОкна.ОтдельноеОкно);
	
КонецПроцедуры

&НаКлиенте
Процедура ИсторияВерсий(Команда)
	
	СтруктураПараметров = Новый Структура;
	СтруктураПараметров.Вставить("ВыводитьВсеВерсии",    Истина);
	СтруктураПараметров.Вставить("ЭтоПервыйЗапуск",      Ложь);
	СтруктураПараметров.Вставить("ЕстьИзменениеВерсии",  Истина);
	СтруктураПараметров.Вставить("ВесПредыдущейВерсии",  1000000);
	СтруктураПараметров.Вставить("ТекущаяВерсия",        ТекущаяВерсия);
	
	ОткрытьФорму("Справочник.ПЛ_УведомленияОСобытиях.Форма.ОписаниеИзмененийКонфигурации",
		СтруктураПараметров);
	
КонецПроцедуры

&НаКлиенте
Процедура ОПрограмме(Команда)
	
	Если Платформа83 Тогда
		Выполнить("ОткрытьФорму(""Справочник.ПЛ_УведомленияОСобытиях.Форма.ОПрограмме"",,,,,,, РежимОткрытияОкнаФормы.БлокироватьОкноВладельца)");
	Иначе
		ОткрытьФормуМодально("Справочник.ПЛ_УведомленияОСобытиях.Форма.ОПрограмме");
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ПерейтиВНовуюФорму(Команда)
	
	Закрыть();
	ОткрытьФорму("Справочник.ПЛ_УведомленияОСобытиях.Форма.УведомленияОСобытиях");
	
КонецПроцедуры

///////////////////////////////////////////////////////////////////////////////
// СЛУЖЕБНЫЕ ПРОЦЕДУРЫ И ФУНКЦИИ

&НаКлиенте
Процедура УстановитьОтборУведомленийПоТекущемуСобытию()
	
	Если ТипЗнч(Элементы.События.ТекущаяСтрока) = Тип("СтрокаГруппировкиДинамическогоСписка") Тогда
		Возврат;
	КонецЕсли;
	
	ТекущиеДанные = Элементы.События.ТекущиеДанные;
	Если ТекущиеДанные = Неопределено Тогда
		Событие = ПустоеСобытие;
	Иначе
		Событие = ТекущиеДанные.Ссылка;
	КонецЕсли;
	
	УстановитьОтборУведомленийПоСобытию(Событие, ЗначениеЗаполнено(Событие));
	
КонецПроцедуры

&НаКлиенте
Процедура УстановитьОтборУведомленийПоСобытию(Событие, Использование = Истина)
	
	УстановитьОтборСписка(Уведомления, "Событие", Событие, ВидСравненияКомпоновкиДанных.ВИерархии, Использование)
	
КонецПроцедуры

&НаКлиенте
Процедура УстановитьОтборСписка(Список, ПолеОтбора, ЗначениеОтбора, ВидСравнения, Использование = Истина)
	
	ПолеКомпоновки = Новый ПолеКомпоновкиДанных(ПолеОтбора);

	Отбор = Список.Отбор.Элементы;
	
	// Удаление имеющихся отборов
	Счетчик = 0;
	Пока Счетчик < Отбор.Количество() Цикл
		
		ЭлементОтбора = Отбор[Счетчик];
		
		Если ТипЗнч(ЭлементОтбора) = Тип("ЭлементОтбораКомпоновкиДанных")
			И ЭлементОтбора.ЛевоеЗначение = ПолеКомпоновки Тогда
			Отбор.Удалить(ЭлементОтбора);
			Прервать;
		Иначе
			Счетчик = Счетчик + 1;
		КонецЕсли;
	КонецЦикла;
	
	// Добавление отбора
	Если ЗначениеЗаполнено(ЗначениеОтбора) Тогда
		УсловиеОтбора = Отбор.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
		УсловиеОтбора.ЛевоеЗначение     = ПолеКомпоновки;
		УсловиеОтбора.ВидСравнения      = ВидСравнения;
		УсловиеОтбора.ПравоеЗначение    = ЗначениеОтбора;
		УсловиеОтбора.Использование     = Использование;
	КонецЕсли;
	
КонецПроцедуры
